Extensions/ИнтеграцияGreenApi/Enums/iga_ТипыТекстовСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_ТипыТекстовСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТекстОтветаНаНекорректнуюОценку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстОставьтеКомментарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстОтветаНаОставленныйКомментарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстОтветаНаНекорректныйФилиал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстПросьбыОценитьОператора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстВопросаРешенВопросИлиНет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстПриветствияИВыбораФилиала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстПросьбыОжиданияОператора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстПросьбыОжидатьОператораВРабочееВремя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстСообщенияПослеПрохожденияОжидания15Минут</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстСообщенияОТомЧтоЗапросПереданДругомуОператору</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстСообщенияОЗавершенииДиалогаВСвязиСНеактивностьюПользователя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстПриветствияОператора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстПослеЗавершенияДиалогаОператором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстПриОтказеОтПриемаДиалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстВыбораЯзыка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстПриветствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекстОповещенияОЗаписи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_ТипыТекстовСообщений/Ext/ManagerModule.bsl
Функция ТекстПоУмолчанию(Тип) Экспорт
	
	Если Тип = Перечисления.iga_ТипыТекстовСообщений.ТекстОтветаНаНекорректныйФилиал Тогда
		Текст = "Пожалуйста, введите только *номер* нужного филиала ( *цифру от 1 до [КоличествоГородов]* ) в зависимости от от интересующиего Вас города. Если Вас интересует [ПервыйГород] - введите *цифру 1* , если Вас интересует [ПоследнийГород] - введите *цифру [КоличествоГородов]* и т.д.";
	ИначеЕсли Тип = Перечисления.iga_ТипыТекстовСообщений.ТекстОтветаНаНекорректнуюОценку Тогда
		Текст = "Извините, необходимо отправить цифру от 1 до 5. Где 1 - плохо, 5 - отлично.";
	ИначеЕсли Тип = Перечисления.iga_ТипыТекстовСообщений.ТекстОставьтеКомментарий Тогда
		Текст = "Оставьте пожалуйста свой комментарий. Нам очень важно Ваше мнение. (по желанию)";
	ИначеЕсли Тип = Перечисления.iga_ТипыТекстовСообщений.ТекстОтветаНаОставленныйКомментарий Тогда
		Текст = "Спасибо, Ваше мнение важно для нас!";
	ИначеЕсли Тип = Перечисления.iga_ТипыТекстовСообщений.ТекстПросьбыОценитьОператора Тогда
		Текст = "Пожалуйста, оцените работу оператора. Отправьте *цифру от 1 до 5* , где 1 - плохо, 5 - отлично. (по желанию)";
	ИначеЕсли Тип = Перечисления.iga_ТипыТекстовСообщений.ТекстВопросаРешенВопросИлиНет Тогда
		Текст = "Если Ваш вопрос не был решен, напишите, пожалуйста, в чат любое сообщение для начала диалога. 
							|Если у Вас нет вопросов, просьба не отвечать на данное сообщение.";
	ИначеЕсли Тип = Перечисления.iga_ТипыТекстовСообщений.ТекстПриветствияИВыбораФилиала Тогда
		Текст = "Пожалуйста, отправьте в ответ *только цифру* филиала ( *от 1 до [КоличествоГородов]* ): 
				|[СписокГородов]";
	ИначеЕсли Тип = Перечисления.iga_ТипыТекстовСообщений.ТекстПросьбыОжиданияОператора Тогда
		Текст = "Пожалуйста, ожидайте соединения. Оператор скоро свяжется с Вами!.";
	ИначеЕсли Тип = Перечисления.iga_ТипыТекстовСообщений.ТекстПросьбыОжидатьОператораВРабочееВремя Тогда
		Текст = "Спасибо за обращение. Пожалуйста, ожидайте, менеджер Вам ответит в ближайшее рабочее время.";
	ИначеЕсли Тип = Перечисления.iga_ТипыТекстовСообщений.ТекстСообщенияПослеПрохожденияОжидания15Минут Тогда
		Текст = "Диалог завершен. Благодарим Вас за обращение! (это автоматическое сообщение, отвечать на него не нужно).";
	ИначеЕсли Тип = Перечисления.iga_ТипыТекстовСообщений.ТекстСообщенияОТомЧтоЗапросПереданДругомуОператору Тогда
		Текст = "Ваш запрос передан свободному оператору. Пожалуйста, ожидайте ответа в ближайшее время";
	ИначеЕсли Тип = Перечисления.iga_ТипыТекстовСообщений.ТекстСообщенияОЗавершенииДиалогаВСвязиСНеактивностьюПользователя Тогда
		Текст = "Диалог завершен из-за отсутствия активности с вашей стороны. Будем рады помочь снова!";
	ИначеЕсли Тип = Перечисления.iga_ТипыТекстовСообщений.ТекстПриветствияОператора Тогда
		Текст = "Добрый день. Меня зовут [ИмяОператора], я менеджер отдела продаж.";
	ИначеЕсли Тип = Перечисления.iga_ТипыТекстовСообщений.ТекстПослеЗавершенияДиалогаОператором Тогда
		Текст = "Сеанс общения с оператором завершен. Спасибо за обращение!";
	ИначеЕсли Тип = Перечисления.iga_ТипыТекстовСообщений.ТекстПриОтказеОтПриемаДиалога Тогда
		Текст = "Ваш запрос передан свободному менеджеру. Пожалуйста, ожидайте ответа в ближайшее время.";
	ИначеЕсли Тип = Перечисления.iga_ТипыТекстовСообщений.ТекстВыбораЯзыка Тогда
		Текст = "Тілді таңдаңыз/Пожалуйста, выберите язык";
	ИначеЕсли Тип = Перечисления.iga_ТипыТекстовСообщений.ТекстПриветствия Тогда
		Текст = "Добрый день. Вы написали в Контакт-Центр сети Медицинских центров Divera.";
	ИначеЕсли Тип = Перечисления.iga_ТипыТекстовСообщений.ТекстОповещенияОЗаписи Тогда
		
		Текст = "Вы успешно записаны в медицинский центр Divera!
		|[ПроцедураПрием], [СпециальностьИФИОВрача]
		|	[ДатаЗаписи] и [ВремяЗаписи]
		|	Ждем Вас по адресу [АдресПодразделения]
		|	2 Gis: [Адрес2Гис]
		|	Просим прийти за 10 минут до приёма, для регистрации.
		|		
		|		Divera медициналық орталығына сәтті жазылдыңыз!
		|		[ПроцедураПрием], [СпециальностьИФИОВрача]
		|			[ДатаЗаписи] және [ВремяЗаписи]
		|			Сізді мына мекенжай бойынша күтеміз: [АдресПодразделения]
		|			Тіркелу үшін қабылдауға 10 минут қалғанда келуіңізді сұраймыз.";
		
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции
